set_property SRC_FILE_INFO {cfile:d:/01-Codes/XilinxCode/Vernier_tdc/v4_carry4_tdc/prj/v4_carry4_tdc_1.gen/sources_1/ip/mmcm_50m_to_400m/mmcm_50m_to_400m.xdc rfile:../v4_carry4_tdc_1.gen/sources_1/ip/mmcm_50m_to_400m/mmcm_50m_to_400m.xdc id:1 order:EARLY scoped_inst:u_mmcm/inst} [current_design]
set_property SRC_FILE_INFO {cfile:D:/01-Codes/XilinxCode/Vernier_tdc/v4_carry4_tdc/sim/tdc_constraints.xdc rfile:../../sim/tdc_constraints.xdc id:2} [current_design]
current_instance u_mmcm/inst
set_property src_info {type:SCOPED_XDC file:1 line:57 export:INPUT save:INPUT read:READ} [current_design]
set_input_jitter [get_clocks -of_objects [get_ports clk_in1]] 0.2
current_instance
set_property src_info {type:XDC file:2 line:6 export:INPUT save:INPUT read:READ} [current_design]
create_clock -period 20.000 -name clk_50m [get_ports clk_50m]
set_property src_info {type:XDC file:2 line:9 export:INPUT save:INPUT read:READ} [current_design]
create_generated_clock -name clk_400m -source [get_clocks clk_50m] -multiply_by 8 [get_ports clk_400m]
set_property src_info {type:XDC file:2 line:15 export:INPUT save:INPUT read:READ} [current_design]
set_clock_uncertainty -setup 0.100 [get_clocks clk_400m]
set_property src_info {type:XDC file:2 line:16 export:INPUT save:INPUT read:READ} [current_design]
set_clock_uncertainty -hold 0.050 [get_clocks clk_400m]
set_property src_info {type:XDC file:2 line:19 export:INPUT save:INPUT read:READ} [current_design]
set_clock_groups -asynchronous -group [get_clocks clk_50m] -group [get_clocks clk_400m]
set_property src_info {type:XDC file:2 line:24 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock clk_400m -max 1.0 [get_ports pwm_in]
set_property src_info {type:XDC file:2 line:25 export:INPUT save:INPUT read:READ} [current_design]
set_input_delay -clock clk_400m -min 0.5 [get_ports pwm_in]
set_property src_info {type:XDC file:2 line:28 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock clk_400m -max 2.0 [get_ports time_interval*]
set_property src_info {type:XDC file:2 line:29 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock clk_400m -max 2.0 [get_ports valid]
set_property src_info {type:XDC file:2 line:30 export:INPUT save:INPUT read:READ} [current_design]
set_output_delay -clock clk_400m -max 2.0 [get_ports measurement_error]
set_property src_info {type:XDC file:2 line:33 export:INPUT save:INPUT read:READ} [current_design]
set_multicycle_path 2 -setup -from [get_clocks clk_400m] -to [get_clocks clk_400m]
set_property src_info {type:XDC file:2 line:34 export:INPUT save:INPUT read:READ} [current_design]
set_multicycle_path 1 -hold -from [get_clocks clk_400m] -to [get_clocks clk_400m]
set_property src_info {type:XDC file:2 line:40 export:INPUT save:INPUT read:READ} [current_design]
set_property BEL CARRY4 [get_cells -hierarchical -filter {REF_NAME == CARRY4}]
set_property src_info {type:XDC file:2 line:41 export:INPUT save:INPUT read:READ} [current_design]
set_property LOCK_PINS {A0:A A1:B A2:C A3:D B0:B1 B1:B2 B2:B3 B3:CY} [get_cells -hierarchical -filter {REF_NAME == CARRY4}]
